[
  {
    "id": 950387,
    "title": "A Minecraft Movie",
    "overview": "Four misfits find themselves struggling with ordinary problems when they are suddenly pulled through a mysterious portal into the Overworld: a bizarre, cubic wonderland that thrives on imagination. To get back home, they'll have to master this world while embarking on a magical quest with an unexpected, expert crafter, Steve.",
    "release_date": "2025-03-31",
    "backdrop_path": "/2Nti3gYAX513wvhp8IiLL6ZDyOm.jpg"
  },
  {
    "id": 552524,
    "title": "Lilo & Stitch",
    "overview": "The wildly funny and touching story of a lonely Hawaiian girl and the fugitive alien who helps to mend her broken family.",
    "release_date": "2025-05-17",
    "backdrop_path": "/7Zx3wDG5bBtcfk8lcnCWDOLM4Y4.jpg"
  },
  {
    "id": 575265,
    "title": "Mission: Impossible - The Final Reckoning",
    "overview": "Ethan Hunt and team continue their search for the terrifying AI known as the Entity — which has infiltrated intelligence networks all over the globe — with the world's governments and a mysterious ghost from Hunt's past on their trail. Joined by new allies and armed with the means to shut the Entity down for good, Hunt is in a race against time to prevent the world as we know it from changing forever.",
    "release_date": "2025-05-17",
    "backdrop_path": "/3VkPqpjKikQg2M2n6xgTfR9xr7E.jpg"
  },
  {
    "id": 715287,
    "title": "Stepmom's Desire",
    "overview": "Sang-jin, who was envious of her neighbor after getting a beautiful wife, Ask your wife's friend Gian to take over the son's extracurricular teacher, Sang-jin, who left work early, accidentally sees Gian's shower. A man who wants to have sex with his son's tutor, And a son who wants to have a good time with a young stepmom, Ji-an and Jin-hee, who want money, are disappointed with her husband, and Bin-jin gives her body to a young son.",
    "release_date": "2020-05-29",
    "backdrop_path": "/54mPXhtaUejdQtaCYeJPJP8ZfXX.jpg"
  },
  {
    "id": 950396,
    "title": "The Gorge",
    "overview": "Two highly trained operatives grow close from a distance after being sent to guard opposite sides of a mysterious gorge. When an evil below emerges, they must work together to survive what lies within.",
    "release_date": "2025-02-13",
    "backdrop_path": "/9nhjGaFLKtddDPtPaX5EmKqsWdH.jpg"
  }
]